iterate/iterate/apps/kit/firmware/targets/stackchan/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# CoreS3 uses 16 MB QIO flash and quad 80 MHz PSRAM. DSP state belongs in
# PSRAM where the library permits it; DMA queues and ISR-visible chunks remain
# explicit internal allocations in the platform owner.
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
# ESP-IDF 5.4 renamed the old SPIRAM option.  This merely permits explicitly
# selected non-audio tasks to use external stacks; the audio owner keeps every
# DMA/ISR-visible byte in internal memory and never relies on this blanket.
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# ESP-SR missed its 32 ms deadline under the debug-oriented compiler profile
# in the prior hardware experiment. Performance is therefore a correctness
# setting for this target, while the linker size report remains a required
# artifact so the tradeoff cannot disappear from review.
CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_RUN_TIME_COUNTER_TYPE_U64=y
CONFIG_FREERTOS_RUN_TIME_STATS_USING_ESP_TIMER=y

# IDF's flag covers its own ISR path. The final target will additionally audit
# every Iterate callback/callee in the linked ELF before a physical build is
# accepted; otherwise a cache-disabled flash operation could stall audio.
CONFIG_I2S_ISR_IRAM_SAFE=y
CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE=n
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
